/* automatically generated by rust-bindgen 0.57.0 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const MB_LEN_MAX: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT64_MIN: i64 = -9223372036854775808;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const INT64_MAX: u64 = 9223372036854775807;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const UINT64_MAX: i32 = -1;

pub const TEE_PANIC_ID_TEE_BIGINTCOMPUTEEXTENDEDGCD: u32 = 6913;
pub const TEE_PANIC_ID_TEE_BIGINTISPROBABLEPRIME: u32 = 6914;
pub const TEE_PANIC_ID_TEE_BIGINTRELATIVEPRIME: u32 = 6915;
pub const TEE_PANIC_ID_TEE_BIGINTCOMPUTEFMM: u32 = 7169;
pub const TEE_PANIC_ID_TEE_BIGINTCONVERTFROMFMM: u32 = 7170;
pub const TEE_PANIC_ID_TEE_BIGINTCONVERTTOFMM: u32 = 7171;
pub const TEE_NUM_PARAMS: u32 = 4;
pub const TEE_MEM_INPUT: u32 = 1;
pub const TEE_MEM_OUTPUT: u32 = 2;
pub const TEE_MEMREF_0_USED: u32 = 1;
pub const TEE_MEMREF_1_USED: u32 = 2;
pub const TEE_MEMREF_2_USED: u32 = 4;
pub const TEE_MEMREF_3_USED: u32 = 8;
pub const TEE_SE_READER_NAME_MAX: u32 = 20;
pub const TA_FLAG_USER_MODE: u32 = 0;
pub const TA_FLAG_EXEC_DDR: u32 = 0;
pub const TA_FLAG_SINGLE_INSTANCE: u32 = 4;
pub const TA_FLAG_MULTI_SESSION: u32 = 8;
pub const TA_FLAG_INSTANCE_KEEP_ALIVE: u32 = 16;
pub const TA_FLAG_SECURE_DATA_PATH: u32 = 32;
pub const TA_FLAG_REMAP_SUPPORT: u32 = 0;
pub const TA_FLAG_CACHE_MAINTENANCE: u32 = 128;
pub const TA_FLAG_CONCURRENT: u32 = 256;
pub const TA_FLAG_DEVICE_ENUM: u32 = 512;
pub const TA_FLAG_DEVICE_ENUM_SUPP: u32 = 1024;
pub const TA_PROP_STR_SINGLE_INSTANCE: &'static [u8; 22usize] = b"gpd.ta.singleInstance\0";
pub const TA_PROP_STR_MULTI_SESSION: &'static [u8; 20usize] = b"gpd.ta.multiSession\0";
pub const TA_PROP_STR_KEEP_ALIVE: &'static [u8; 25usize] = b"gpd.ta.instanceKeepAlive\0";
pub const TA_PROP_STR_DATA_SIZE: &'static [u8; 16usize] = b"gpd.ta.dataSize\0";
pub const TA_PROP_STR_STACK_SIZE: &'static [u8; 17usize] = b"gpd.ta.stackSize\0";
pub const TA_PROP_STR_VERSION: &'static [u8; 15usize] = b"gpd.ta.version\0";
pub const TA_PROP_STR_DESCRIPTION: &'static [u8; 19usize] = b"gpd.ta.description\0";
pub const __GNUC_VA_LIST: u32 = 1;
pub const TRACE_MIN: u32 = 0;
pub const TRACE_ERROR: u32 = 1;
pub const TRACE_INFO: u32 = 2;
pub const TRACE_DEBUG: u32 = 3;
pub const TRACE_FLOW: u32 = 4;
pub const TRACE_MAX: u32 = 4;
pub const TRACE_PRINTF_LEVEL: u32 = 1;
pub const MAX_PRINT_SIZE: u32 = 256;
pub const MAX_FUNC_PRINT_SIZE: u32 = 32;
pub const TRACE_LEVEL: u32 = 4;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = i64;
pub type uintmax_t = u64;
pub type size_t = libc::c_ulong;
pub type wchar_t = libc::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: libc::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type TEE_Result = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_UUID {
    pub timeLow: u32,
    pub timeMid: u16,
    pub timeHiAndVersion: u16,
    pub clockSeqAndNode: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_TEE_UUID() {
    assert_eq!(
        ::core::mem::size_of::<TEE_UUID>(),
        16usize,
        concat!("Size of: ", stringify!(TEE_UUID))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_UUID>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_UUID))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_UUID>())).timeLow as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_UUID),
            "::",
            stringify!(timeLow)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_UUID>())).timeMid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_UUID),
            "::",
            stringify!(timeMid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_UUID>())).timeHiAndVersion as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_UUID),
            "::",
            stringify!(timeHiAndVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_UUID>())).clockSeqAndNode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_UUID),
            "::",
            stringify!(clockSeqAndNode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_Identity {
    pub login: u32,
    pub uuid: TEE_UUID,
}
#[test]
fn bindgen_test_layout_TEE_Identity() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Identity>(),
        20usize,
        concat!("Size of: ", stringify!(TEE_Identity))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Identity>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_Identity))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Identity>())).login as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Identity),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Identity>())).uuid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Identity),
            "::",
            stringify!(uuid)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TEE_Param {
    pub memref: TEE_Param__bindgen_ty_1,
    pub value: TEE_Param__bindgen_ty_2,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TEE_Param__bindgen_ty_1 {
    pub buffer: *mut libc::c_void,
    pub size: u32,
}
#[test]
fn bindgen_test_layout_TEE_Param__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Param__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(TEE_Param__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Param__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(TEE_Param__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Param__bindgen_ty_1>())).buffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Param__bindgen_ty_1),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Param__bindgen_ty_1>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Param__bindgen_ty_1),
            "::",
            stringify!(size)
        )
    );
}
impl Default for TEE_Param__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_Param__bindgen_ty_2 {
    pub a: u32,
    pub b: u32,
}
#[test]
fn bindgen_test_layout_TEE_Param__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Param__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(TEE_Param__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Param__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_Param__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Param__bindgen_ty_2>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Param__bindgen_ty_2),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Param__bindgen_ty_2>())).b as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Param__bindgen_ty_2),
            "::",
            stringify!(b)
        )
    );
}
#[test]
fn bindgen_test_layout_TEE_Param() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Param>(),
        16usize,
        concat!("Size of: ", stringify!(TEE_Param))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Param>(),
        8usize,
        concat!("Alignment of ", stringify!(TEE_Param))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Param>())).memref as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Param),
            "::",
            stringify!(memref)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Param>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Param),
            "::",
            stringify!(value)
        )
    );
}
impl Default for TEE_Param {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_TASessionHandle {
    _unused: [u8; 0],
}
pub type TEE_TASessionHandle = *mut __TEE_TASessionHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_PropSetHandle {
    _unused: [u8; 0],
}
pub type TEE_PropSetHandle = *mut __TEE_PropSetHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_ObjectHandle {
    _unused: [u8; 0],
}
pub type TEE_ObjectHandle = *mut __TEE_ObjectHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_ObjectEnumHandle {
    _unused: [u8; 0],
}
pub type TEE_ObjectEnumHandle = *mut __TEE_ObjectEnumHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_OperationHandle {
    _unused: [u8; 0],
}
pub type TEE_OperationHandle = *mut __TEE_OperationHandle;
pub type TEE_ObjectType = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct TEE_ObjectInfo {
    pub objectType: u32,
    pub __bindgen_anon_1: TEE_ObjectInfo__bindgen_ty_1,
    pub __bindgen_anon_2: TEE_ObjectInfo__bindgen_ty_2,
    pub objectUsage: u32,
    pub dataSize: u32,
    pub dataPosition: u32,
    pub handleFlags: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TEE_ObjectInfo__bindgen_ty_1 {
    pub keySize: u32,
    pub objectSize: u32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_TEE_ObjectInfo__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<TEE_ObjectInfo__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(TEE_ObjectInfo__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_ObjectInfo__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_ObjectInfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_ObjectInfo__bindgen_ty_1>())).keySize as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo__bindgen_ty_1),
            "::",
            stringify!(keySize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_ObjectInfo__bindgen_ty_1>())).objectSize as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo__bindgen_ty_1),
            "::",
            stringify!(objectSize)
        )
    );
}
impl Default for TEE_ObjectInfo__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TEE_ObjectInfo__bindgen_ty_2 {
    pub maxKeySize: u32,
    pub maxObjectSize: u32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_TEE_ObjectInfo__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<TEE_ObjectInfo__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(TEE_ObjectInfo__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_ObjectInfo__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_ObjectInfo__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_ObjectInfo__bindgen_ty_2>())).maxKeySize as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo__bindgen_ty_2),
            "::",
            stringify!(maxKeySize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_ObjectInfo__bindgen_ty_2>())).maxObjectSize as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo__bindgen_ty_2),
            "::",
            stringify!(maxObjectSize)
        )
    );
}
impl Default for TEE_ObjectInfo__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_TEE_ObjectInfo() {
    assert_eq!(
        ::core::mem::size_of::<TEE_ObjectInfo>(),
        28usize,
        concat!("Size of: ", stringify!(TEE_ObjectInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_ObjectInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_ObjectInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_ObjectInfo>())).objectType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo),
            "::",
            stringify!(objectType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_ObjectInfo>())).objectUsage as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo),
            "::",
            stringify!(objectUsage)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_ObjectInfo>())).dataSize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo),
            "::",
            stringify!(dataSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_ObjectInfo>())).dataPosition as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo),
            "::",
            stringify!(dataPosition)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_ObjectInfo>())).handleFlags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_ObjectInfo),
            "::",
            stringify!(handleFlags)
        )
    );
}
impl Default for TEE_ObjectInfo {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub const TEE_Whence_TEE_DATA_SEEK_SET: TEE_Whence = 0;
pub const TEE_Whence_TEE_DATA_SEEK_CUR: TEE_Whence = 1;
pub const TEE_Whence_TEE_DATA_SEEK_END: TEE_Whence = 2;
pub type TEE_Whence = libc::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct TEE_Attribute {
    pub attributeID: u32,
    pub content: TEE_Attribute__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TEE_Attribute__bindgen_ty_1 {
    pub ref_: TEE_Attribute__bindgen_ty_1__bindgen_ty_1,
    pub value: TEE_Attribute__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TEE_Attribute__bindgen_ty_1__bindgen_ty_1 {
    pub buffer: *mut libc::c_void,
    pub length: u32,
}
#[test]
fn bindgen_test_layout_TEE_Attribute__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Attribute__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Attribute__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_Attribute__bindgen_ty_1__bindgen_ty_1>())).buffer
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_Attribute__bindgen_ty_1__bindgen_ty_1>())).length
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(length)
        )
    );
}
impl Default for TEE_Attribute__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_Attribute__bindgen_ty_1__bindgen_ty_2 {
    pub a: u32,
    pub b: u32,
}
#[test]
fn bindgen_test_layout_TEE_Attribute__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Attribute__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Attribute__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_Attribute__bindgen_ty_1__bindgen_ty_2>())).a as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_Attribute__bindgen_ty_1__bindgen_ty_2>())).b as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(b)
        )
    );
}
#[test]
fn bindgen_test_layout_TEE_Attribute__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Attribute__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(TEE_Attribute__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Attribute__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(TEE_Attribute__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_Attribute__bindgen_ty_1>())).ref_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute__bindgen_ty_1),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_Attribute__bindgen_ty_1>())).value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
impl Default for TEE_Attribute__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_TEE_Attribute() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Attribute>(),
        24usize,
        concat!("Size of: ", stringify!(TEE_Attribute))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Attribute>(),
        8usize,
        concat!("Alignment of ", stringify!(TEE_Attribute))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Attribute>())).attributeID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute),
            "::",
            stringify!(attributeID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Attribute>())).content as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Attribute),
            "::",
            stringify!(content)
        )
    );
}
impl Default for TEE_Attribute {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub const TEE_OperationMode_TEE_MODE_ENCRYPT: TEE_OperationMode = 0;
pub const TEE_OperationMode_TEE_MODE_DECRYPT: TEE_OperationMode = 1;
pub const TEE_OperationMode_TEE_MODE_SIGN: TEE_OperationMode = 2;
pub const TEE_OperationMode_TEE_MODE_VERIFY: TEE_OperationMode = 3;
pub const TEE_OperationMode_TEE_MODE_MAC: TEE_OperationMode = 4;
pub const TEE_OperationMode_TEE_MODE_DIGEST: TEE_OperationMode = 5;
pub const TEE_OperationMode_TEE_MODE_DERIVE: TEE_OperationMode = 6;
pub type TEE_OperationMode = libc::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_OperationInfo {
    pub algorithm: u32,
    pub operationClass: u32,
    pub mode: u32,
    pub digestLength: u32,
    pub maxKeySize: u32,
    pub keySize: u32,
    pub requiredKeyUsage: u32,
    pub handleState: u32,
}
#[test]
fn bindgen_test_layout_TEE_OperationInfo() {
    assert_eq!(
        ::core::mem::size_of::<TEE_OperationInfo>(),
        32usize,
        concat!("Size of: ", stringify!(TEE_OperationInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_OperationInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_OperationInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfo>())).algorithm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfo>())).operationClass as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(operationClass)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfo>())).mode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfo>())).digestLength as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(digestLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfo>())).maxKeySize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(maxKeySize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfo>())).keySize as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(keySize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfo>())).requiredKeyUsage as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(requiredKeyUsage)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfo>())).handleState as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfo),
            "::",
            stringify!(handleState)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_OperationInfoKey {
    pub keySize: u32,
    pub requiredKeyUsage: u32,
}
#[test]
fn bindgen_test_layout_TEE_OperationInfoKey() {
    assert_eq!(
        ::core::mem::size_of::<TEE_OperationInfoKey>(),
        8usize,
        concat!("Size of: ", stringify!(TEE_OperationInfoKey))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_OperationInfoKey>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_OperationInfoKey))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfoKey>())).keySize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoKey),
            "::",
            stringify!(keySize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoKey>())).requiredKeyUsage as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoKey),
            "::",
            stringify!(requiredKeyUsage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct TEE_OperationInfoMultiple {
    pub algorithm: u32,
    pub operationClass: u32,
    pub mode: u32,
    pub digestLength: u32,
    pub maxKeySize: u32,
    pub handleState: u32,
    pub operationState: u32,
    pub numberOfKeys: u32,
    pub keyInformation: __IncompleteArrayField<TEE_OperationInfoKey>,
}
#[test]
fn bindgen_test_layout_TEE_OperationInfoMultiple() {
    assert_eq!(
        ::core::mem::size_of::<TEE_OperationInfoMultiple>(),
        32usize,
        concat!("Size of: ", stringify!(TEE_OperationInfoMultiple))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_OperationInfoMultiple>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_OperationInfoMultiple))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).algorithm as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).operationClass as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(operationClass)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).mode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).digestLength as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(digestLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).maxKeySize as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(maxKeySize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).handleState as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(handleState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).operationState as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(operationState)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).numberOfKeys as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(numberOfKeys)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_OperationInfoMultiple>())).keyInformation as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_OperationInfoMultiple),
            "::",
            stringify!(keyInformation)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_Time {
    pub seconds: u32,
    pub millis: u32,
}
#[test]
fn bindgen_test_layout_TEE_Time() {
    assert_eq!(
        ::core::mem::size_of::<TEE_Time>(),
        8usize,
        concat!("Size of: ", stringify!(TEE_Time))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_Time>(),
        4usize,
        concat!("Alignment of ", stringify!(TEE_Time))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Time>())).seconds as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Time),
            "::",
            stringify!(seconds)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_Time>())).millis as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_Time),
            "::",
            stringify!(millis)
        )
    );
}
pub type TEE_BigInt = u32;
pub type TEE_BigIntFMM = u32;
pub type TEE_BigIntFMMContext = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_SEServiceHandle {
    _unused: [u8; 0],
}
pub type TEE_SEServiceHandle = *mut __TEE_SEServiceHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_SEReaderHandle {
    _unused: [u8; 0],
}
pub type TEE_SEReaderHandle = *mut __TEE_SEReaderHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_SESessionHandle {
    _unused: [u8; 0],
}
pub type TEE_SESessionHandle = *mut __TEE_SESessionHandle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __TEE_SEChannelHandle {
    _unused: [u8; 0],
}
pub type TEE_SEChannelHandle = *mut __TEE_SEChannelHandle;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TEE_SEReaderProperties {
    pub sePresent: bool,
    pub teeOnly: bool,
    pub selectResponseEnable: bool,
}
#[test]
fn bindgen_test_layout_TEE_SEReaderProperties() {
    assert_eq!(
        ::core::mem::size_of::<TEE_SEReaderProperties>(),
        3usize,
        concat!("Size of: ", stringify!(TEE_SEReaderProperties))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_SEReaderProperties>(),
        1usize,
        concat!("Alignment of ", stringify!(TEE_SEReaderProperties))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_SEReaderProperties>())).sePresent as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_SEReaderProperties),
            "::",
            stringify!(sePresent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_SEReaderProperties>())).teeOnly as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_SEReaderProperties),
            "::",
            stringify!(teeOnly)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<TEE_SEReaderProperties>())).selectResponseEnable as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_SEReaderProperties),
            "::",
            stringify!(selectResponseEnable)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TEE_SEAID {
    pub buffer: *mut u8,
    pub bufferLen: size_t,
}
#[test]
fn bindgen_test_layout_TEE_SEAID() {
    assert_eq!(
        ::core::mem::size_of::<TEE_SEAID>(),
        16usize,
        concat!("Size of: ", stringify!(TEE_SEAID))
    );
    assert_eq!(
        ::core::mem::align_of::<TEE_SEAID>(),
        8usize,
        concat!("Alignment of ", stringify!(TEE_SEAID))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_SEAID>())).buffer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_SEAID),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<TEE_SEAID>())).bufferLen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TEE_SEAID),
            "::",
            stringify!(bufferLen)
        )
    );
}
impl Default for TEE_SEAID {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
pub type TEE_ErrorOrigin = u32;
pub type TEE_Session = *mut libc::c_void;
pub const utee_time_category_UTEE_TIME_CAT_SYSTEM: utee_time_category = 0;
pub const utee_time_category_UTEE_TIME_CAT_TA_PERSISTENT: utee_time_category = 1;
pub const utee_time_category_UTEE_TIME_CAT_REE: utee_time_category = 2;
pub type utee_time_category = libc::c_uint;
pub const utee_entry_func_UTEE_ENTRY_FUNC_OPEN_SESSION: utee_entry_func = 0;
pub const utee_entry_func_UTEE_ENTRY_FUNC_CLOSE_SESSION: utee_entry_func = 1;
pub const utee_entry_func_UTEE_ENTRY_FUNC_INVOKE_COMMAND: utee_entry_func = 2;
pub type utee_entry_func = libc::c_uint;
pub const utee_cache_operation_TEE_CACHECLEAN: utee_cache_operation = 0;
pub const utee_cache_operation_TEE_CACHEFLUSH: utee_cache_operation = 1;
pub const utee_cache_operation_TEE_CACHEINVALIDATE: utee_cache_operation = 2;
pub type utee_cache_operation = libc::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct utee_params {
    pub types: u64,
    pub vals: [u64; 8usize],
}
#[test]
fn bindgen_test_layout_utee_params() {
    assert_eq!(
        ::core::mem::size_of::<utee_params>(),
        72usize,
        concat!("Size of: ", stringify!(utee_params))
    );
    assert_eq!(
        ::core::mem::align_of::<utee_params>(),
        8usize,
        concat!("Alignment of ", stringify!(utee_params))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<utee_params>())).types as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(utee_params),
            "::",
            stringify!(types)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<utee_params>())).vals as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(utee_params),
            "::",
            stringify!(vals)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct utee_attribute {
    pub a: u64,
    pub b: u64,
    pub attribute_id: u32,
}
#[test]
fn bindgen_test_layout_utee_attribute() {
    assert_eq!(
        ::core::mem::size_of::<utee_attribute>(),
        24usize,
        concat!("Size of: ", stringify!(utee_attribute))
    );
    assert_eq!(
        ::core::mem::align_of::<utee_attribute>(),
        8usize,
        concat!("Alignment of ", stringify!(utee_attribute))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<utee_attribute>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(utee_attribute),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<utee_attribute>())).b as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(utee_attribute),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<utee_attribute>())).attribute_id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(utee_attribute),
            "::",
            stringify!(attribute_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ta_head {
    pub uuid: TEE_UUID,
    pub stack_size: u32,
    pub flags: u32,
    pub depr_entry: u64,
}
#[test]
fn bindgen_test_layout_ta_head() {
    assert_eq!(
        ::core::mem::size_of::<ta_head>(),
        32usize,
        concat!("Size of: ", stringify!(ta_head))
    );
    assert_eq!(
        ::core::mem::align_of::<ta_head>(),
        8usize,
        concat!("Alignment of ", stringify!(ta_head))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ta_head>())).uuid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ta_head),
            "::",
            stringify!(uuid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ta_head>())).stack_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ta_head),
            "::",
            stringify!(stack_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ta_head>())).flags as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ta_head),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ta_head>())).depr_entry as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ta_head),
            "::",
            stringify!(depr_entry)
        )
    );
}
extern "C" {
    pub fn __utee_call_elf_init_fn();
}
extern "C" {
    pub fn __utee_call_elf_fini_fn();
}
extern "C" {
    pub fn __utee_tcb_init();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __elf_phdr_info {
    pub reserved: u32,
    pub count: u16,
    pub reserved2: u8,
    pub zero: libc::c_char,
    pub dlpi: *mut dl_phdr_info,
}
#[test]
fn bindgen_test_layout___elf_phdr_info() {
    assert_eq!(
        ::core::mem::size_of::<__elf_phdr_info>(),
        16usize,
        concat!("Size of: ", stringify!(__elf_phdr_info))
    );
    assert_eq!(
        ::core::mem::align_of::<__elf_phdr_info>(),
        8usize,
        concat!("Alignment of ", stringify!(__elf_phdr_info))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info>())).count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info>())).reserved2 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info>())).zero as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info),
            "::",
            stringify!(zero)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info>())).dlpi as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info),
            "::",
            stringify!(dlpi)
        )
    );
}
impl Default for __elf_phdr_info {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __elf_phdr_info32 {
    pub reserved: u32,
    pub count: u16,
    pub reserved2: u8,
    pub zero: libc::c_char,
    pub dlpi: u32,
}
#[test]
fn bindgen_test_layout___elf_phdr_info32() {
    assert_eq!(
        ::core::mem::size_of::<__elf_phdr_info32>(),
        12usize,
        concat!("Size of: ", stringify!(__elf_phdr_info32))
    );
    assert_eq!(
        ::core::mem::align_of::<__elf_phdr_info32>(),
        4usize,
        concat!("Alignment of ", stringify!(__elf_phdr_info32))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info32>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info32),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info32>())).count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info32),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info32>())).reserved2 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info32),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info32>())).zero as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info32),
            "::",
            stringify!(zero)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__elf_phdr_info32>())).dlpi as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__elf_phdr_info32),
            "::",
            stringify!(dlpi)
        )
    );
}
extern "C" {
    pub static mut __elf_phdr_info: __elf_phdr_info;
}
pub const user_ta_prop_type_USER_TA_PROP_TYPE_BOOL: user_ta_prop_type = 0;
pub const user_ta_prop_type_USER_TA_PROP_TYPE_U32: user_ta_prop_type = 1;
pub const user_ta_prop_type_USER_TA_PROP_TYPE_UUID: user_ta_prop_type = 2;
pub const user_ta_prop_type_USER_TA_PROP_TYPE_IDENTITY: user_ta_prop_type = 3;
pub const user_ta_prop_type_USER_TA_PROP_TYPE_STRING: user_ta_prop_type = 4;
pub const user_ta_prop_type_USER_TA_PROP_TYPE_BINARY_BLOCK: user_ta_prop_type = 5;
pub type user_ta_prop_type = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct user_ta_property {
    pub name: *const libc::c_char,
    pub type_: user_ta_prop_type,
    pub value: *const libc::c_void,
}
#[test]
fn bindgen_test_layout_user_ta_property() {
    assert_eq!(
        ::core::mem::size_of::<user_ta_property>(),
        24usize,
        concat!("Size of: ", stringify!(user_ta_property))
    );
    assert_eq!(
        ::core::mem::align_of::<user_ta_property>(),
        8usize,
        concat!("Alignment of ", stringify!(user_ta_property))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<user_ta_property>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(user_ta_property),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<user_ta_property>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(user_ta_property),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<user_ta_property>())).value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(user_ta_property),
            "::",
            stringify!(value)
        )
    );
}
impl Default for user_ta_property {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
extern "C" {
    pub static mut ta_props: [user_ta_property; 0usize];
}
extern "C" {
    pub static ta_num_props: size_t;
}
extern "C" {
    pub static mut ta_param_types: u32;
}
extern "C" {
    pub static mut ta_params: [TEE_Param; 4usize];
}
extern "C" {
    pub fn tahead_get_trace_level() -> libc::c_int;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
extern "C" {
    pub static mut trace_level: libc::c_int;
}
extern "C" {
    pub static mut trace_ext_prefix: [libc::c_char; 0usize];
}
extern "C" {
    pub fn trace_ext_puts(str_: *const libc::c_char);
}
extern "C" {
    pub fn trace_ext_get_thread_id() -> libc::c_int;
}
extern "C" {
    pub fn trace_set_level(level: libc::c_int);
}
extern "C" {
    pub fn trace_get_level() -> libc::c_int;
}
extern "C" {
    pub fn plat_trace_ext_puts(str_: *const libc::c_char);
}
extern "C" {
    pub fn trace_vprintf(
        func: *const libc::c_char,
        line: libc::c_int,
        level: libc::c_int,
        level_ok: bool,
        fmt: *const libc::c_char,
        args: *mut __va_list_tag,
    );
}
extern "C" {
    pub fn trace_printf(
        func: *const libc::c_char,
        line: libc::c_int,
        level: libc::c_int,
        level_ok: bool,
        fmt: *const libc::c_char,
        ...
    );
}
extern "C" {
    pub fn dhex_dump(
        function: *const libc::c_char,
        line: libc::c_int,
        level: libc::c_int,
        buf: *const libc::c_void,
        len: libc::c_int,
    );
}
extern "C" {
    pub fn TEE_GetPropertyAsString(
        propsetOrEnumerator: TEE_PropSetHandle,
        name: *const libc::c_char,
        valueBuffer: *mut libc::c_char,
        valueBufferLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetPropertyAsBool(
        propsetOrEnumerator: TEE_PropSetHandle,
        name: *const libc::c_char,
        value: *mut bool,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetPropertyAsU32(
        propsetOrEnumerator: TEE_PropSetHandle,
        name: *const libc::c_char,
        value: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetPropertyAsBinaryBlock(
        propsetOrEnumerator: TEE_PropSetHandle,
        name: *const libc::c_char,
        valueBuffer: *mut libc::c_void,
        valueBufferLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetPropertyAsUUID(
        propsetOrEnumerator: TEE_PropSetHandle,
        name: *const libc::c_char,
        value: *mut TEE_UUID,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetPropertyAsIdentity(
        propsetOrEnumerator: TEE_PropSetHandle,
        name: *const libc::c_char,
        value: *mut TEE_Identity,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AllocatePropertyEnumerator(enumerator: *mut TEE_PropSetHandle) -> TEE_Result;
}
extern "C" {
    pub fn TEE_FreePropertyEnumerator(enumerator: TEE_PropSetHandle);
}
extern "C" {
    pub fn TEE_StartPropertyEnumerator(enumerator: TEE_PropSetHandle, propSet: TEE_PropSetHandle);
}
extern "C" {
    pub fn TEE_ResetPropertyEnumerator(enumerator: TEE_PropSetHandle);
}
extern "C" {
    pub fn TEE_GetPropertyName(
        enumerator: TEE_PropSetHandle,
        nameBuffer: *mut libc::c_void,
        nameBufferLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetNextProperty(enumerator: TEE_PropSetHandle) -> TEE_Result;
}
extern "C" {
    pub fn TEE_Panic(panicCode: TEE_Result);
}
extern "C" {
    pub fn TEE_OpenTASession(
        destination: *const TEE_UUID,
        cancellationRequestTimeout: u32,
        paramTypes: u32,
        params: *mut TEE_Param,
        session: *mut TEE_TASessionHandle,
        returnOrigin: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_CloseTASession(session: TEE_TASessionHandle);
}
extern "C" {
    pub fn TEE_InvokeTACommand(
        session: TEE_TASessionHandle,
        cancellationRequestTimeout: u32,
        commandID: u32,
        paramTypes: u32,
        params: *mut TEE_Param,
        returnOrigin: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetCancellationFlag() -> bool;
}
extern "C" {
    pub fn TEE_UnmaskCancellation() -> bool;
}
extern "C" {
    pub fn TEE_MaskCancellation() -> bool;
}
extern "C" {
    pub fn TEE_CheckMemoryAccessRights(
        accessFlags: u32,
        buffer: *mut libc::c_void,
        size: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_SetInstanceData(instanceData: *const libc::c_void);
}
extern "C" {
    pub fn TEE_GetInstanceData() -> *const libc::c_void;
}
extern "C" {
    pub fn TEE_Malloc(size: u32, hint: u32) -> *mut libc::c_void;
}
extern "C" {
    pub fn TEE_Realloc(buffer: *mut libc::c_void, newSize: u32) -> *mut libc::c_void;
}
extern "C" {
    pub fn TEE_Free(buffer: *mut libc::c_void);
}
extern "C" {
    pub fn TEE_MemMove(
        dest: *mut libc::c_void,
        src: *const libc::c_void,
        size: u32,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn TEE_MemCompare(
        buffer1: *const libc::c_void,
        buffer2: *const libc::c_void,
        size: u32,
    ) -> i32;
}
extern "C" {
    pub fn TEE_MemFill(buff: *mut libc::c_void, x: u32, size: u32) -> *mut libc::c_void;
}
extern "C" {
    pub fn TEE_GetObjectInfo(object: TEE_ObjectHandle, objectInfo: *mut TEE_ObjectInfo);
}
extern "C" {
    pub fn TEE_GetObjectInfo1(
        object: TEE_ObjectHandle,
        objectInfo: *mut TEE_ObjectInfo,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_RestrictObjectUsage(object: TEE_ObjectHandle, objectUsage: u32);
}
extern "C" {
    pub fn TEE_RestrictObjectUsage1(object: TEE_ObjectHandle, objectUsage: u32) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetObjectBufferAttribute(
        object: TEE_ObjectHandle,
        attributeID: u32,
        buffer: *mut libc::c_void,
        size: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetObjectValueAttribute(
        object: TEE_ObjectHandle,
        attributeID: u32,
        a: *mut u32,
        b: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_CloseObject(object: TEE_ObjectHandle);
}
extern "C" {
    pub fn TEE_AllocateTransientObject(
        objectType: TEE_ObjectType,
        maxKeySize: u32,
        object: *mut TEE_ObjectHandle,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_FreeTransientObject(object: TEE_ObjectHandle);
}
extern "C" {
    pub fn TEE_ResetTransientObject(object: TEE_ObjectHandle);
}
extern "C" {
    pub fn TEE_PopulateTransientObject(
        object: TEE_ObjectHandle,
        attrs: *const TEE_Attribute,
        attrCount: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_InitRefAttribute(
        attr: *mut TEE_Attribute,
        attributeID: u32,
        buffer: *const libc::c_void,
        length: u32,
    );
}
extern "C" {
    pub fn TEE_InitValueAttribute(attr: *mut TEE_Attribute, attributeID: u32, a: u32, b: u32);
}
extern "C" {
    pub fn TEE_CopyObjectAttributes(destObject: TEE_ObjectHandle, srcObject: TEE_ObjectHandle);
}
extern "C" {
    pub fn TEE_CopyObjectAttributes1(
        destObject: TEE_ObjectHandle,
        srcObject: TEE_ObjectHandle,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GenerateKey(
        object: TEE_ObjectHandle,
        keySize: u32,
        params: *const TEE_Attribute,
        paramCount: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_OpenPersistentObject(
        storageID: u32,
        objectID: *const libc::c_void,
        objectIDLen: u32,
        flags: u32,
        object: *mut TEE_ObjectHandle,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_CreatePersistentObject(
        storageID: u32,
        objectID: *const libc::c_void,
        objectIDLen: u32,
        flags: u32,
        attributes: TEE_ObjectHandle,
        initialData: *const libc::c_void,
        initialDataLen: u32,
        object: *mut TEE_ObjectHandle,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_CloseAndDeletePersistentObject(object: TEE_ObjectHandle);
}
extern "C" {
    pub fn TEE_CloseAndDeletePersistentObject1(object: TEE_ObjectHandle) -> TEE_Result;
}
extern "C" {
    pub fn TEE_RenamePersistentObject(
        object: TEE_ObjectHandle,
        newObjectID: *const libc::c_void,
        newObjectIDLen: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AllocatePersistentObjectEnumerator(
        objectEnumerator: *mut TEE_ObjectEnumHandle,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_FreePersistentObjectEnumerator(objectEnumerator: TEE_ObjectEnumHandle);
}
extern "C" {
    pub fn TEE_ResetPersistentObjectEnumerator(objectEnumerator: TEE_ObjectEnumHandle);
}
extern "C" {
    pub fn TEE_StartPersistentObjectEnumerator(
        objectEnumerator: TEE_ObjectEnumHandle,
        storageID: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetNextPersistentObject(
        objectEnumerator: TEE_ObjectEnumHandle,
        objectInfo: *mut TEE_ObjectInfo,
        objectID: *mut libc::c_void,
        objectIDLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_ReadObjectData(
        object: TEE_ObjectHandle,
        buffer: *mut libc::c_void,
        size: u32,
        count: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_WriteObjectData(
        object: TEE_ObjectHandle,
        buffer: *const libc::c_void,
        size: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_TruncateObjectData(object: TEE_ObjectHandle, size: u32) -> TEE_Result;
}
extern "C" {
    pub fn TEE_SeekObjectData(
        object: TEE_ObjectHandle,
        offset: i32,
        whence: TEE_Whence,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AllocateOperation(
        operation: *mut TEE_OperationHandle,
        algorithm: u32,
        mode: u32,
        maxKeySize: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_FreeOperation(operation: TEE_OperationHandle);
}
extern "C" {
    pub fn TEE_GetOperationInfo(
        operation: TEE_OperationHandle,
        operationInfo: *mut TEE_OperationInfo,
    );
}
extern "C" {
    pub fn TEE_GetOperationInfoMultiple(
        operation: TEE_OperationHandle,
        operationInfoMultiple: *mut TEE_OperationInfoMultiple,
        operationSize: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_ResetOperation(operation: TEE_OperationHandle);
}
extern "C" {
    pub fn TEE_SetOperationKey(operation: TEE_OperationHandle, key: TEE_ObjectHandle)
        -> TEE_Result;
}
extern "C" {
    pub fn TEE_SetOperationKey2(
        operation: TEE_OperationHandle,
        key1: TEE_ObjectHandle,
        key2: TEE_ObjectHandle,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_CopyOperation(dstOperation: TEE_OperationHandle, srcOperation: TEE_OperationHandle);
}
extern "C" {
    pub fn TEE_IsAlgorithmSupported(algId: u32, element: u32) -> TEE_Result;
}
extern "C" {
    pub fn TEE_DigestUpdate(
        operation: TEE_OperationHandle,
        chunk: *const libc::c_void,
        chunkSize: u32,
    );
}
extern "C" {
    pub fn TEE_DigestDoFinal(
        operation: TEE_OperationHandle,
        chunk: *const libc::c_void,
        chunkLen: u32,
        hash: *mut libc::c_void,
        hashLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_CipherInit(operation: TEE_OperationHandle, IV: *const libc::c_void, IVLen: u32);
}
extern "C" {
    pub fn TEE_CipherUpdate(
        operation: TEE_OperationHandle,
        srcData: *const libc::c_void,
        srcLen: u32,
        destData: *mut libc::c_void,
        destLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_CipherDoFinal(
        operation: TEE_OperationHandle,
        srcData: *const libc::c_void,
        srcLen: u32,
        destData: *mut libc::c_void,
        destLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_MACInit(operation: TEE_OperationHandle, IV: *const libc::c_void, IVLen: u32);
}
extern "C" {
    pub fn TEE_MACUpdate(
        operation: TEE_OperationHandle,
        chunk: *const libc::c_void,
        chunkSize: u32,
    );
}
extern "C" {
    pub fn TEE_MACComputeFinal(
        operation: TEE_OperationHandle,
        message: *const libc::c_void,
        messageLen: u32,
        mac: *mut libc::c_void,
        macLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_MACCompareFinal(
        operation: TEE_OperationHandle,
        message: *const libc::c_void,
        messageLen: u32,
        mac: *const libc::c_void,
        macLen: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AEInit(
        operation: TEE_OperationHandle,
        nonce: *const libc::c_void,
        nonceLen: u32,
        tagLen: u32,
        AADLen: u32,
        payloadLen: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AEUpdateAAD(
        operation: TEE_OperationHandle,
        AADdata: *const libc::c_void,
        AADdataLen: u32,
    );
}
extern "C" {
    pub fn TEE_AEUpdate(
        operation: TEE_OperationHandle,
        srcData: *const libc::c_void,
        srcLen: u32,
        destData: *mut libc::c_void,
        destLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AEEncryptFinal(
        operation: TEE_OperationHandle,
        srcData: *const libc::c_void,
        srcLen: u32,
        destData: *mut libc::c_void,
        destLen: *mut u32,
        tag: *mut libc::c_void,
        tagLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AEDecryptFinal(
        operation: TEE_OperationHandle,
        srcData: *const libc::c_void,
        srcLen: u32,
        destData: *mut libc::c_void,
        destLen: *mut u32,
        tag: *mut libc::c_void,
        tagLen: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AsymmetricEncrypt(
        operation: TEE_OperationHandle,
        params: *const TEE_Attribute,
        paramCount: u32,
        srcData: *const libc::c_void,
        srcLen: u32,
        destData: *mut libc::c_void,
        destLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AsymmetricDecrypt(
        operation: TEE_OperationHandle,
        params: *const TEE_Attribute,
        paramCount: u32,
        srcData: *const libc::c_void,
        srcLen: u32,
        destData: *mut libc::c_void,
        destLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AsymmetricSignDigest(
        operation: TEE_OperationHandle,
        params: *const TEE_Attribute,
        paramCount: u32,
        digest: *const libc::c_void,
        digestLen: u32,
        signature: *mut libc::c_void,
        signatureLen: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_AsymmetricVerifyDigest(
        operation: TEE_OperationHandle,
        params: *const TEE_Attribute,
        paramCount: u32,
        digest: *const libc::c_void,
        digestLen: u32,
        signature: *const libc::c_void,
        signatureLen: u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_DeriveKey(
        operation: TEE_OperationHandle,
        params: *const TEE_Attribute,
        paramCount: u32,
        derivedKey: TEE_ObjectHandle,
    );
}
extern "C" {
    pub fn TEE_GenerateRandom(randomBuffer: *mut libc::c_void, randomBufferLen: u32);
}
extern "C" {
    pub fn TEE_GetSystemTime(time: *mut TEE_Time);
}
extern "C" {
    pub fn TEE_Wait(timeout: u32) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetTAPersistentTime(time: *mut TEE_Time) -> TEE_Result;
}
extern "C" {
    pub fn TEE_SetTAPersistentTime(time: *const TEE_Time) -> TEE_Result;
}
extern "C" {
    pub fn TEE_GetREETime(time: *mut TEE_Time);
}
extern "C" {
    pub fn TEE_BigIntFMMSizeInU32(modulusSizeInBits: u32) -> u32;
}
extern "C" {
    pub fn TEE_BigIntFMMContextSizeInU32(modulusSizeInBits: u32) -> u32;
}
extern "C" {
    pub fn TEE_BigIntInit(bigInt: *mut TEE_BigInt, len: u32);
}
extern "C" {
    pub fn TEE_BigIntInitFMMContext(
        context: *mut TEE_BigIntFMMContext,
        len: u32,
        modulus: *const TEE_BigInt,
    );
}
extern "C" {
    pub fn TEE_BigIntInitFMM(bigIntFMM: *mut TEE_BigIntFMM, len: u32);
}
extern "C" {
    pub fn TEE_BigIntConvertFromOctetString(
        dest: *mut TEE_BigInt,
        buffer: *const u8,
        bufferLen: u32,
        sign: i32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_BigIntConvertToOctetString(
        buffer: *mut u8,
        bufferLen: *mut u32,
        bigInt: *const TEE_BigInt,
    ) -> TEE_Result;
}
extern "C" {
    pub fn TEE_BigIntConvertFromS32(dest: *mut TEE_BigInt, shortVal: i32);
}
extern "C" {
    pub fn TEE_BigIntConvertToS32(dest: *mut i32, src: *const TEE_BigInt) -> TEE_Result;
}
extern "C" {
    pub fn TEE_BigIntCmp(op1: *const TEE_BigInt, op2: *const TEE_BigInt) -> i32;
}
extern "C" {
    pub fn TEE_BigIntCmpS32(op: *const TEE_BigInt, shortVal: i32) -> i32;
}
extern "C" {
    pub fn TEE_BigIntShiftRight(dest: *mut TEE_BigInt, op: *const TEE_BigInt, bits: size_t);
}
extern "C" {
    pub fn TEE_BigIntGetBit(src: *const TEE_BigInt, bitIndex: u32) -> bool;
}
extern "C" {
    pub fn TEE_BigIntGetBitCount(src: *const TEE_BigInt) -> u32;
}
extern "C" {
    pub fn TEE_BigIntAdd(dest: *mut TEE_BigInt, op1: *const TEE_BigInt, op2: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntSub(dest: *mut TEE_BigInt, op1: *const TEE_BigInt, op2: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntNeg(dest: *mut TEE_BigInt, op: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntMul(dest: *mut TEE_BigInt, op1: *const TEE_BigInt, op2: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntSquare(dest: *mut TEE_BigInt, op: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntDiv(
        dest_q: *mut TEE_BigInt,
        dest_r: *mut TEE_BigInt,
        op1: *const TEE_BigInt,
        op2: *const TEE_BigInt,
    );
}
extern "C" {
    pub fn TEE_BigIntMod(dest: *mut TEE_BigInt, op: *const TEE_BigInt, n: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntAddMod(
        dest: *mut TEE_BigInt,
        op1: *const TEE_BigInt,
        op2: *const TEE_BigInt,
        n: *const TEE_BigInt,
    );
}
extern "C" {
    pub fn TEE_BigIntSubMod(
        dest: *mut TEE_BigInt,
        op1: *const TEE_BigInt,
        op2: *const TEE_BigInt,
        n: *const TEE_BigInt,
    );
}
extern "C" {
    pub fn TEE_BigIntMulMod(
        dest: *mut TEE_BigInt,
        op1: *const TEE_BigInt,
        op2: *const TEE_BigInt,
        n: *const TEE_BigInt,
    );
}
extern "C" {
    pub fn TEE_BigIntSquareMod(dest: *mut TEE_BigInt, op: *const TEE_BigInt, n: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntInvMod(dest: *mut TEE_BigInt, op: *const TEE_BigInt, n: *const TEE_BigInt);
}
extern "C" {
    pub fn TEE_BigIntRelativePrime(op1: *const TEE_BigInt, op2: *const TEE_BigInt) -> bool;
}
extern "C" {
    pub fn TEE_BigIntComputeExtendedGcd(
        gcd: *mut TEE_BigInt,
        u: *mut TEE_BigInt,
        v: *mut TEE_BigInt,
        op1: *const TEE_BigInt,
        op2: *const TEE_BigInt,
    );
}
extern "C" {
    pub fn TEE_BigIntIsProbablePrime(op: *const TEE_BigInt, confidenceLevel: u32) -> i32;
}
extern "C" {
    pub fn TEE_BigIntConvertToFMM(
        dest: *mut TEE_BigIntFMM,
        src: *const TEE_BigInt,
        n: *const TEE_BigInt,
        context: *const TEE_BigIntFMMContext,
    );
}
extern "C" {
    pub fn TEE_BigIntConvertFromFMM(
        dest: *mut TEE_BigInt,
        src: *const TEE_BigIntFMM,
        n: *const TEE_BigInt,
        context: *const TEE_BigIntFMMContext,
    );
}
extern "C" {
    pub fn TEE_BigIntFMMConvertToBigInt(
        dest: *mut TEE_BigInt,
        src: *const TEE_BigIntFMM,
        n: *const TEE_BigInt,
        context: *const TEE_BigIntFMMContext,
    );
}
extern "C" {
    pub fn TEE_BigIntComputeFMM(
        dest: *mut TEE_BigIntFMM,
        op1: *const TEE_BigIntFMM,
        op2: *const TEE_BigIntFMM,
        n: *const TEE_BigInt,
        context: *const TEE_BigIntFMMContext,
    );
}
extern "C" {
    pub fn _utee_return(ret: libc::c_ulong);
}
extern "C" {
    pub fn _utee_log(buf: *const libc::c_void, len: size_t);
}
extern "C" {
    pub fn _utee_panic(code: libc::c_ulong);
}
extern "C" {
    pub fn _utee_get_property(
        prop_set: libc::c_ulong,
        index: libc::c_ulong,
        name: *mut libc::c_void,
        name_len: *mut u32,
        buf: *mut libc::c_void,
        blen: *mut u32,
        prop_type: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_get_property_name_to_index(
        prop_set: libc::c_ulong,
        name: *const libc::c_void,
        name_len: libc::c_ulong,
        index: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_open_ta_session(
        dest: *const TEE_UUID,
        cancel_req_to: libc::c_ulong,
        params: *mut utee_params,
        sess: *mut u32,
        ret_orig: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_close_ta_session(sess: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_invoke_ta_command(
        sess: libc::c_ulong,
        cancel_req_to: libc::c_ulong,
        cmd_id: libc::c_ulong,
        params: *mut utee_params,
        ret_orig: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_check_access_rights(
        flags: u32,
        buf: *const libc::c_void,
        len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_get_cancellation_flag(cancel: *mut u32) -> TEE_Result;
}
extern "C" {
    pub fn _utee_unmask_cancellation(old_mask: *mut u32) -> TEE_Result;
}
extern "C" {
    pub fn _utee_mask_cancellation(old_mask: *mut u32) -> TEE_Result;
}
extern "C" {
    pub fn _utee_wait(timeout: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_get_time(cat: libc::c_ulong, time: *mut TEE_Time) -> TEE_Result;
}
extern "C" {
    pub fn _utee_set_ta_time(time: *const TEE_Time) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_state_alloc(
        algo: libc::c_ulong,
        op_mode: libc::c_ulong,
        key1: libc::c_ulong,
        key2: libc::c_ulong,
        state: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_state_copy(dst: libc::c_ulong, src: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_state_free(state: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_hash_init(
        state: libc::c_ulong,
        iv: *const libc::c_void,
        iv_len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_hash_update(
        state: libc::c_ulong,
        chunk: *const libc::c_void,
        chunk_size: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_hash_final(
        state: libc::c_ulong,
        chunk: *const libc::c_void,
        chunk_size: size_t,
        hash: *mut libc::c_void,
        hash_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cipher_init(
        state: libc::c_ulong,
        iv: *const libc::c_void,
        iv_len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cipher_update(
        state: libc::c_ulong,
        src: *const libc::c_void,
        src_len: size_t,
        dest: *mut libc::c_void,
        dest_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cipher_final(
        state: libc::c_ulong,
        src: *const libc::c_void,
        src_len: size_t,
        dest: *mut libc::c_void,
        dest_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_get_info(obj: libc::c_ulong, info: *mut TEE_ObjectInfo) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_restrict_usage(obj: libc::c_ulong, usage: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_get_attr(
        obj: libc::c_ulong,
        attr_id: libc::c_ulong,
        buffer: *mut libc::c_void,
        size: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_alloc(
        type_: libc::c_ulong,
        max_size: libc::c_ulong,
        obj: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_close(obj: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_reset(obj: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_populate(
        obj: libc::c_ulong,
        attrs: *mut utee_attribute,
        attr_count: libc::c_ulong,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_copy(dst_obj: libc::c_ulong, src_obj: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_obj_generate_key(
        obj: libc::c_ulong,
        key_size: libc::c_ulong,
        params: *const utee_attribute,
        param_count: libc::c_ulong,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_derive_key(
        state: libc::c_ulong,
        params: *const utee_attribute,
        param_count: libc::c_ulong,
        derived_key: libc::c_ulong,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cryp_random_number_generate(buf: *mut libc::c_void, blen: size_t) -> TEE_Result;
}
extern "C" {
    pub fn _utee_authenc_init(
        state: libc::c_ulong,
        nonce: *const libc::c_void,
        nonce_len: size_t,
        tag_len: size_t,
        aad_len: size_t,
        payload_len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_authenc_update_aad(
        state: libc::c_ulong,
        aad_data: *const libc::c_void,
        aad_data_len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_authenc_update_payload(
        state: libc::c_ulong,
        src_data: *const libc::c_void,
        src_len: size_t,
        dest_data: *mut libc::c_void,
        dest_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_authenc_enc_final(
        state: libc::c_ulong,
        src_data: *const libc::c_void,
        src_len: size_t,
        dest_data: *mut libc::c_void,
        dest_len: *mut u64,
        tag: *mut libc::c_void,
        tag_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_authenc_dec_final(
        state: libc::c_ulong,
        src_data: *const libc::c_void,
        src_len: size_t,
        dest_data: *mut libc::c_void,
        dest_len: *mut u64,
        tag: *const libc::c_void,
        tag_len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_asymm_operate(
        state: libc::c_ulong,
        params: *const utee_attribute,
        num_params: libc::c_ulong,
        src_data: *const libc::c_void,
        src_len: size_t,
        dest_data: *mut libc::c_void,
        dest_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_asymm_verify(
        state: libc::c_ulong,
        params: *const utee_attribute,
        num_params: libc::c_ulong,
        data: *const libc::c_void,
        data_len: size_t,
        sig: *const libc::c_void,
        sig_len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_open(
        storage_id: libc::c_ulong,
        object_id: *const libc::c_void,
        object_id_len: size_t,
        flags: libc::c_ulong,
        obj: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_create(
        storage_id: libc::c_ulong,
        object_id: *const libc::c_void,
        object_id_len: size_t,
        flags: libc::c_ulong,
        attr: libc::c_ulong,
        data: *const libc::c_void,
        len: size_t,
        obj: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_del(obj: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_rename(
        obj: libc::c_ulong,
        new_obj_id: *const libc::c_void,
        new_obj_id_len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_alloc_enum(obj_enum: *mut u32) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_free_enum(obj_enum: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_reset_enum(obj_enum: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_start_enum(
        obj_enum: libc::c_ulong,
        storage_id: libc::c_ulong,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_next_enum(
        obj_enum: libc::c_ulong,
        info: *mut TEE_ObjectInfo,
        obj_id: *mut libc::c_void,
        len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_read(
        obj: libc::c_ulong,
        data: *mut libc::c_void,
        len: size_t,
        count: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_write(
        obj: libc::c_ulong,
        data: *const libc::c_void,
        len: size_t,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_trunc(obj: libc::c_ulong, len: size_t) -> TEE_Result;
}
extern "C" {
    pub fn _utee_storage_obj_seek(
        obj: libc::c_ulong,
        offset: i32,
        whence: libc::c_ulong,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_service_open(seServiceHandle: *mut u32) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_service_close(seServiceHandle: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_service_get_readers(
        seServiceHandle: libc::c_ulong,
        r: *mut u32,
        len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_reader_get_prop(r: libc::c_ulong, p: *mut u32) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_reader_get_name(
        r: libc::c_ulong,
        name: *mut libc::c_char,
        name_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_reader_open_session(r: libc::c_ulong, s: *mut u32) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_reader_close_sessions(r: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_session_is_closed(s: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_session_get_atr(
        s: libc::c_ulong,
        atr: *mut libc::c_void,
        atr_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_session_open_channel(
        s: libc::c_ulong,
        is_logical: libc::c_ulong,
        aid_buffer: *const libc::c_void,
        aid_buffer_len: size_t,
        c: *mut u32,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_session_close(s: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_channel_select_next(c: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_channel_get_select_resp(
        c: libc::c_ulong,
        resp: *mut libc::c_void,
        resp_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_channel_transmit(
        c: libc::c_ulong,
        cmd: *mut libc::c_void,
        cmd_len: size_t,
        resp: *mut libc::c_void,
        resp_len: *mut u64,
    ) -> TEE_Result;
}
extern "C" {
    pub fn _utee_se_channel_close(c: libc::c_ulong) -> TEE_Result;
}
extern "C" {
    pub fn _utee_cache_operation(va: *mut libc::c_void, l: size_t, op: libc::c_ulong)
        -> TEE_Result;
}
extern "C" {
    pub fn _utee_gprof_send(buf: *mut libc::c_void, size: size_t, id: *mut u32) -> TEE_Result;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dl_phdr_info {
    pub _address: u8,
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: libc::c_uint,
    pub fp_offset: libc::c_uint,
    pub overflow_arg_area: *mut libc::c_void,
    pub reg_save_area: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    assert_eq!(
        ::core::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::core::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__va_list_tag>())).gp_offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__va_list_tag>())).fp_offset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__va_list_tag>())).overflow_arg_area as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__va_list_tag>())).reg_save_area as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
impl Default for __va_list_tag {
    fn default() -> Self {
        unsafe { ::core::mem::zeroed() }
    }
}
